====================
Simple Math Operator
====================

4 + 5

---

(source_file
  (addition
    (integer)
    (integer)))

======================
Test Simple Precedence
======================

4 + 5 * 2

---

(source_file
  (addition
    (integer)
    (multiplication
      (integer)
      (integer))))

=====================
Test Group Precedence
=====================

(4 + 5) * 2

---

(source_file
  (multiplication
    (group
      (addition
        (integer)
        (integer)))
    (integer)))

===================================
Test Group Precedence with Negation
===================================

-(4 + 5) * 2

---

(source_file
  (multiplication
    (negation
      (group
        (addition
          (integer)
          (integer))))
    (integer)))